<html>
	<body>
<b>hiwii系统和hiwii语言介绍</b>
<a href="syntax.html">hiwii语言语法</a>
<a href="tut1.html">hiwii语言教程</a>
<a href="/hiwii/">hiwii语言会话</a>
<hr/>
<div>
<p>hiwii系统和我们一般接触的计算机系统不同，hiwii语言也不是一个计算机编程语言。hiwii语言是一种会话语言，她是一种接近自然语言，而又语法简单。在具备自然语言特征的同时，hiwii语言又具有编程语言的特点，能够以会话形式完成对hiwii系统的"编程"。</p>
<p>首先必须说明以下三点：</p>
<p>第一点，我们必须确立一个思想，那就是智能系统在形式上必须和我们人类是一样的。hiwii系统是这样一个智能系统，她在会话形式上和人类是一样的。当前大部分人对计算机的印象就是能够通过鼠标或点触完成操作，而这种方式使我们觉得我们只是在操纵机器，而没有交互的感觉。拥有会话能力的计算机首先必须能够以语言交互的形式进行会话。语言交互的形式是多种多样的，键盘、口语、身体语言等都是人类的语言交互形式。智能系统并不排斥鼠标或点触完成的互动形式，但是她们能够把这种动作以双方都能够理解的语言表示出来，而不仅仅是动作的交互。</p>
<p>第二点，人类的自然语言多种多样，我们需要一种新的语言在人类和hiwii系统间，或者在hiwii系统和hiwii系统之间使用。hiwii语言是在保持人类语言基本特征的前提下，进行提炼抽象而生成的，具有人类语言功能和计算机语言的简洁。</p>
<p>最后一点，hiwii系统将在语言基础上模拟人类思维的形式运行。当前建立在现代计算机模型基础上，完全模拟人类思维虽然要付出运算速度，资源等代价，但我相信这是一条正确的道路，未来随着计算机速度的提高，人工智能一定能够到来。</p>

<p>图灵最早提出是图灵测试。图灵测试的内容就是在相同语言环境下，一个人以不可见方式同时与一台计算机和一个人交谈，如果他不能区分计算机和人，那么这台计算机就通过了图灵测试。说明这台计算机具备人工智能。</p>

<p>一个简洁的hiwii系统/hiwii语言使用说明，需要先有几个名词解释：</p>
<p>对象：表示客观对象，即不依赖于认识存在的事物。</p>
<p>认识：必须依赖于智能系统存在。</p>
<p>运算：由一个或多个的对象或认识，获得一个对象或认识的映射过程，结果对象或认识可以和源对象或认识是同一映射。</p>
<p>判断：系统的主动行为，结果为是或否。</p>
<p>动作：系统主动行为，结果为系统做出状态的改变。</p>


<p>智能系统的三个主动动作：运算、判断和动作。</p>
<p>从人类语言说起：</p>
<p>人类语言的语句一般分为三种：祈使句、疑问句和陈述句。很多语法专家认为语句分四种，第四种语句是感叹句。但是感叹句一般用于表达某些情感。我们主要分析机器智能和人工智能的共同点，机器智能没有发展到情感阶段，因此我们不考虑感情问题，当前也就没有必要考虑感叹句。即使从语法角度分析，感叹句也是一个特殊的陈述句。其陈述的内容包括两个方面：语句表面的意思和传达的情感。</p>
<p>语言交互的目的：</p>
<p>人类语言交互的目的是请求对方做出期望的动作。祈使句很明显是符合这个判断的，因为祈使句的意思就是请求或命令对方完成动作。但是怎么理解疑问句和陈述句？疑问句可以分为一般疑问句和特殊疑问句。一般疑问句可以理解为请求对方完成判断动作，特殊疑问句可以理解为请求对方完成运算动作。陈述句的内容是认识的表述，可以理解为请求完成知识的传递。除了这三种语句，还有一种在交互出现的语言类型，他们一般不以语句的形式出现，这就是答复。一般疑问句的答复往往是"Yes"或"No",特殊疑问句的答复往往是一个简单的表达式。另外三种语句都会出现异常答复。异常答复是传递执行过程错误信息。这几类简单表达式的答复实际都是省略了主语的陈述句，其主语往往是请求内容。</p>
<p>表达式：</p>
<p>字符的有序排列就是表达式。词汇、词汇短语和语句都是表达式。我们认为人类语言词汇只需要分三种：名词、动词和形容词，或者可以这样理解，所有的词汇都分为名词性词汇、动词性词汇和形容词性词汇。扩展到所有表达式，则表达式分为名词性表达式、动词性表达式和形容词性表达式。扩大到语句，则陈述句是形容词性表达式，祈使句是动词性表达式。名词性表达式不能独立成为语句，但是特殊疑问句是带有疑问格式的名词性表达式。独立的名词性表达式可以出现在答复中。另外，一般疑问句是带有疑问格式的形容词性表达式。在人类语言中，交互的主体根据上下文和语法格式确定表达式按照三种表达式中的哪一种进行解释。比如：一般情况下，接收表达式按照祈使句，即动作表达式解释。当发送特殊疑问句以后，把回答作为运算表达式解释。</p>
<p>典型表达式：</p>
<p>典型表达式的格式是：主语+谓语。为便于区分，三种表达式语法表现上各不相同。中文一般用"的"，英文一般用"'s"连标志名词性表达式，比如：大象的鼻子，Tom's toy。形容词表达式有肯定和否定两种形式，中文一般用"是/不是"标志，英文一般用"be/not be"标志。比如：汽车是蓝色的，The tree is tall。动词性表达式在我们的语法中一般没有连接词，通常都是主语+动词，这点中英文是类似的。</p>
<p>在上下文确定的情况下，主语通常省略，成为简单的名词、形容词和动词。</p>


<p>上下文：</p>
<p>在通常会话中，默认把接收到的信息都解释为动词表达式，根据动词表达式的语法分析，再把特殊表达式解释为运算表达式或判断表达式。比如在(主语+谓语)这样的语法中，主语都会解释为运算表达式。</p>
<p>有三种表达式确定了谓语的解释方式，分别是[主语.谓语]形式--谓语是运算表达式。[主语#谓语]形式--谓语是动作表达式。[主语$谓语]或形式[主语!谓语]--谓语是判断表达式。</p>

<p>hiwii语言确定了简单的语法规则，三种表达式都使用相同的语法规则。系统根据上下文确定表达式按照三种表达式中的哪一种进行解释。</p>
<p>hiwii语言的表达式包括：</p>
1、字符
字符串




<p>其中：identifier和function可以作为三种表达式的任意一种，根据语言的上下文，选择作为哪种表达式进行解释。</p>
<p>主语.表达式 只能是运算表达式。</p>
<p>主语#表达式 只能是动作表达式。</p>
<p>主语$表达式  和 主语!表达式 只能作为判断表达式。</p>
<p>字符、字符串、数、一元表达式、二元表达式只能作为运算表达式。</p>
<p>{}程序，可以作为三种表达式的任意一种。</p>
<p>[]/() 只能作为运算表达式</p>

<p>只能在会话上下文中使用的语法：</p>
<p>1，ask()     //用于请求运算</p>
<p>2，whether/whetherNot //用于请求判断</p>
<p>3，answer  //答复运算请求。</p>
<p>4，yes/no  //答复判断请求。</p>
<p>5，error()    //答复执行运算、判断和动作中的异常。</p>

<p>hiwii系统的目标：第一步，使她像个计算机，完成传统的计算机功能，即操作系统功能、编程语言功能和数据库功能。</p>
<p>第二步，使她像个人类的学生，能够通过语言传授知识，并能够使用知识。</p>
<p>完成计算机功能是基础，没什么可说的。关键是如何完成第二步。完成的标志是什么？我们生活中经常使用三段论，比如：</p>
<p>恒星都会发光。</p>
<p>太阳是恒星</p>
<p>因此太阳会发光。</p>
<p>如果我们以陈述句的形式告诉系统前面两个判断：恒星都会发光，太阳是恒星。如果问系统：whether(太阳$发光)，系统如果给出了肯定结果，则表示系统已初步具备学习功能。</p>
</div>
<hr/>
<p>欢迎关注我的微博：hiwiinet。我的微信qq号：332700461。我的博客：hiwiinet.blog.163.com</p>
</body>
</html>