<html>
<head>
	<meta http-equiv=Content-Type content="text/html;charset=utf-8"/>
	<title>hiwii语言</title>
</head>
<body>
<b>hiwii系统和hiwii语言</b>
<a href="intr.html">hiwii语言介绍</a>
<a href="syntax.html">hiwii语言语法</a>
<a href="tut1.html">hiwii语言教程</a>
<a href="download.html">程序下载</a>
<a href="/hiwii/">hiwii语言演示</a>
<a href="board.html">公告板</a>
<hr/>
<p>通知</p>
<p>我将于今年适当时候在广州举办第一次海微语言的见面交流会，邀请所有感兴趣的朋友参加。我将根据报名人数确定时间、地点。报名的朋友请留下联系方式，我将及时通知具体信息。</p>
<p>报名方式：邮件  highlink@126.com</p>
<p>QQ/微信  332700461</p>
<hr/>
<div>
<p>Q&A</p>
<p>1，什么是海微语言?</p>
<p>自图形界面出现以来，大部分计算机用户都是通过鼠标或触摸来完成和计算机的交互。我们缺少一个能够进行人机会话的方式，一个真正的人机对话语言。</p>
<p>海微语言就是这样一种人机交互语言。从功能上看，海微语言是一种格式化语法的自然语言，具备自然语言的特点。</p>
<p>计算机语言通常指计算机编程语言，比如C语言、java、ErLang等。海微语言可以作为计算机语言使用，用他编写一些程序。但海微语言又不同于计算机语言。计算机通常是经过编辑、编译、链接等步骤形成执行程序，然后执行。而海微语言是通过语言交互的形式工作，通过你一言，我一语的交互形式，人机之间更像两个人的交谈。</p>
<p>计算机语言通常不支持人机交互模式，而且没有一种计算机语言完整支持自然语言的三种基本功能，陈述句、疑问句和祈使句。</p>
<p>自然语言就是人们日常使用的语言，比如汉语、英语等。自然语言通常语法复杂，存在歧义等缺点。海微语言在保持自然语言功能的前提下，通过格式化的语法，消除了自然语言中语法复杂、存在歧义等缺点。</p>
<p>海微语言使用符合用户习惯</p>
<p>语言重要的功能是指令传递和知识传递。计算机语言缺少知识传递的特征，而只注重指令传递的特征。</p>
<p>在信息时代，语言的知识载体特征需要语言能够快速的被检索，但是自然语言的语法复杂性使自然语言只能通过关键字检索的简单方法进行检索，而无法进行语句级别的检索。</p>

<p>2，hiwii语言的特点有什么?</p>
<p>海微语言克服了计算机语言和自然语言的缺陷，而又保留了各自的优点，使海微语言具备使用简单、语法严谨、可以作为知识载体等的众多优点。</p>
<p>海微语言支持多语言，用户可以用汉语完成编程。</p>
<p>海微语言的设计思想和一般计算机语言不同。一般计算机语言是为了最终成为可执行的程序，而海微语言基于计算机是一个友好的可交互对象而设计。海微语言把计算机看做交互形式上和人没有区别的对象。</p>
<p>海微语言的基础词汇符合容易理解。</p>
<p>3，我是谁?</p>
<p>&nbsp;&nbsp;我是海微，取意海之大，大而微，一个接近50的老码农，是hiwii语言和hiwii系统的创造者。我的心还年轻，我是一个怀揣梦想，只求一生只做好一件事的人。</p>
<p>4，hiwii系统和hiwii语言的最终目标是什么?</p>
<p>&nbsp;&nbsp;(1)hiwii系统将最终发展成为一个全能操作系统，具备跨平台、可编程、可存储的能力。系统交互可以通过hiwii语言实现，也可以通过图形界面或其它方式交互。</p>
<p>&nbsp;&nbsp;(2)hiwii语言将成为不同系统间的交互标准和接口标准，可以轻松的把多台计算机组合成为一个集群。云计算将不在是一种技术，而是一种计划。只要想，任何人都可以轻松实现云计算。</p>
<p>&nbsp;&nbsp;(3)利用hiwii语言的通用性、可扩展性，可以建立一个知识库，知识搜索将变得简单。</p>
<p>5，我的期望是什么？</p>
<p>&nbsp;&nbsp;我希望得到大家的理解和支持，希望有志同道合的和我一起奋斗。一个留言，一声支持都将使我温暖许多。谢谢那些曾经支持我和未来将要支持我的人。</p>
</div>
<hr/>
<p>欢迎关注我的微博：hiwiinet。我的邮箱：highlink@126.com，我的微信qq号：332700461。我的博客：hiwiinet.blog.163.com</p>
</body>
</html>